# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleParameterValue..::..Value Property
DoubleParameterValue Class See Also
---
The stored value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public double Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Value {
	double get ();
	void set (double value);
}
```

# See Also
DoubleParameterValue Class
Autodesk.Revit.DB Namespace